In [5]:
import sqlite3
conn = sqlite3.connect("flights.db")
cur = conn.cursor()

In [8]:
cur.execute("select * from airlines limit 5;")
results = cur.fetchall()
print(results)

[(0, '1', 'Private flight', '\\N', '-', None, None, None, 'Y'), (1, '2', '135 Airways', '\\N', None, 'GNL', 'GENERAL', 'United States', 'N'), (2, '3', '1Time Airline', '\\N', '1T', 'RNX', 'NEXTIME', 'South Africa', 'Y'), (3, '4', '2 Sqn No 1 Elementary Flying Training School', '\\N', None, 'WYT', None, 'United Kingdom', 'N'), (4, '5', '213 Flight Unit', '\\N', None, 'TFU', None, 'Russia', 'N')]

In [9]:
cur.close()
conn.close()

In [47]:
import sqlite3
conn = sqlite3.connect("flights.db")
cur = conn.cursor()
coords = cur.execute("""select cast(longitude as float), cast(latitude as float) from airports;""").fetchall()

In [23]:
import pandas as pd
conn = sqlite3.connect("flights.db")
df = pd.read_sql_query("select * from airlines limit 5;", conn)
df

,index,id,name,alias,iata,icao,callsign,country,active
0,0,1,Private flight,\N,-,None,None,None,Y
1,1,2,135 Airways,\N,None,GNL,GENERAL,United States,N
2,2,3,1Time Airline,\N,1T,RNX,NEXTIME,South Africa,Y
3,3,4,2 Sqn No 1 Elementary Flying Training School,\N,None,WYT,None,United Kingdom,N
4,4,5,213 Flight Unit,\N,None,TFU,None,Russia,N

In [24]:
df["country"]

0              None
1     United States
2      South Africa
3    United Kingdom
4            Russia
Name: country, dtype: object

In [36]:
routes = pd.read_sql_query("""
select cast(sa.longitude as float) as source_lon,
cast(sa.latitude as float) as source_lat,
cast(da.longitude as float) as dest_lon,
cast(da.latitude as float) as dest_lat
from routes
inner join airports sa on sa.id = routes.source_id
inner join airports da on da.id = routes.dest_id;
""",
conn)
routes

       source_lon  source_lat    dest_lon   dest_lat
0       39.956589   43.449928   49.278728  55.606186
1       48.006278   46.283333   49.278728  55.606186
2       48.006278   46.283333   43.081889  44.225072
3       61.503333   55.305836   49.278728  55.606186
4       61.503333   55.305836   82.650656  55.012622
...           ...         ...         ...        ...
67197  137.514000  -33.058900  138.530556 -34.945000
67198   37.906111   55.408611   74.477556  43.061306
67199   74.477556   43.061306   37.906111  55.408611
67200   74.477556   43.061306   72.793269  40.608989
67201   72.793269   40.608989   74.477556  43.061306

[67202 rows x 4 columns]